{"id":1,"date":"2017-03-10T10:05:01","date_gmt":"2017-03-10T10:05:01","guid":{"rendered":"http:\/\/enhanced-carers.local\/\/?p=1"},"modified":"2017-03-14T12:04:42","modified_gmt":"2017-03-14T12:04:42","slug":"the-importance-of-self-care-for-caregivers","status":"publish","type":"post","link":"https:\/\/enhancedcarers.com\/the-importance-of-self-care-for-caregivers\/","title":{"rendered":"The importance of self-care for caregivers"},"content":{"rendered":"<p>As a caregiver, you probably hear “Take care of yourself” more often than not. It can seem an impossible task. Caring for an aging loved one is an all-encompassing task on top of your other responsibilities at work and at home. If your loved one has recently been discharged from the hospital, caregiving has probably become more intense, and your exhaustion has probably deepened. Self-care is essential if you are to survive. There is a way to care for yourself in the midst of all your responsibilities and here are some realistic ways to make that happen.<\/p>\n<h5>1. Nap when your loved one naps.<\/h5>\n<p>Lock the doors and place a cot, oversized chair or bed next to them. Take a cat nap when they do. Yes, there are many other things you could be doing while they sleep. However, this is an opportunity to squeeze in time to care for yourself, and you need to make it a priority.<\/p>\n<h5>2. Snack when your loved one snacks.<\/h5>\n<p>You may be too tired to eat three big meals a day, and that can lead to snacking on High-fat, high-sugar foods. You can change that. When you make snacks for your loved one, make them as healthy as possible and make enough for yourself. Try whole grain crackers with slices of cheese and apples. Serve small cups of soup and half a sandwich. Create a colorful plate of sliced oranges and grapes. Prepare a morning snack and an afternoon snack. Pour water in the good wine glasses and add a slice of lemon. If you have to prepare snacks anyway, why not make them appetizing for you and your loved one?<\/p>\n<h5>3. Relax for 10 minutes.<\/h5>\n<p>Set the timer and sit down. You can fold the laundry or sort through the mail while you sit down with your feet up. Turn on your loved one’s favorite TV show, make a cup of your favorite tea, coffee or hot chocolate and watch it with them. If they don’t have a favorite show, then find one that you like and watch it together. Do some deep breathing exercises and do not get up until the timer goes off!<\/p>\n<h5>4. Breathe in fresh air.<\/h5>\n<p>It doesn’t matter what climate you live in; you need fresh air. Whether it is a hot, dry southern climate or a cold northern one, you need to breathe in the outdoor air at least once a day. It’s good for the lungs and the mind. If your loved one can’t go outside, stand in front of an open window. Bundle them up if the weather demands it and then let the fresh air in. Do deep breathing exercises and teach your loved one to do them with you. In a matter of minutes, you will feel refreshed.<\/p>\n<p>Caregivers give their all to their loved ones – all day, every day. Caring for yourself can seem impossible unless you begin to look at it differently. Most caregivers aren’t going to ask relatives to step in so they can take a day off and even fewer are going to take the time to go to a spa. However, if you think of the small moments in the day in which you can care for yourself along with your loved one, it will seem easier to accomplish. Read more about how to take care of yourself in our blog post, “How Caregivers Can Avoid Depression.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As a caregiver, you probably hear “Take care of yourself” more often than not. It can seem an impossible task. Caring for an aging loved one is an all-encompassing task on top of your other responsibilities at work and at home. If your loved one has recently been discharged from the hospital, caregiving has probably [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":109,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[11,9,10],"_links":{"self":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts\/1"}],"collection":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/comments?post=1"}],"version-history":[{"count":0,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts\/1\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/media\/109"}],"wp:attachment":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/media?parent=1"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/categories?post=1"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/tags?post=1"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}