{"id":121,"date":"2017-03-14T14:09:42","date_gmt":"2017-03-14T14:09:42","guid":{"rendered":"http:\/\/enhanced-carers.local\/\/?p=121"},"modified":"2017-03-14T14:12:05","modified_gmt":"2017-03-14T14:12:05","slug":"four-fall-prevention-strategies-for-seniors","status":"publish","type":"post","link":"https:\/\/enhancedcarers.com\/four-fall-prevention-strategies-for-seniors\/","title":{"rendered":"Four fall prevention strategies for seniors"},"content":{"rendered":"<p>Falls pose one of the greatest dangers to a senior’s independence and self-sufficiency. More than one-third of people aged 65 and older fall each year, and those who fall once are two to three times more likely to fall again. Among older adults, falls are the leading cause of both fatal and nonfatal injuries and are responsible for significant disability, hospitalization, loss of independence, and reduced quality of life. In fact, the Centers for Disease Control (CDC) says that most fractures among older adults are caused by falls.<\/p>\n<p>Here are four ways in which you can help your loved one to avoid falls.<\/p>\n<h5>1. Practice daily strengthening exercises:<\/h5>\n<p>Balance and coordination can be greatly improved through exercise. Exercise that improves strength, reaction time, and aerobic capacity is the best way to maintain strong muscles and balance. The most effective exercises can be integrated into activities of daily living and focus on balance and strength building. Here are some examples, though they should be carried out as appropriate for the senior’s current strength and balance:<\/p>\n<ul>\n<li>Hold onto the sink and stand on one leg while brushing teeth.<\/li>\n<li>While talking on the telephone, hold onto the wall and lean to one side, then the other to improve balance.<\/li>\n<li>While putting laundry away, bend the knees and then straighten the legs to build muscle strength.<\/li>\n<\/ul>\n<h5>2. Make home modifications to prevent falls:<\/h5>\n<p>Making the house “fall-proof” includes assessing everything from lighting inside and outside the home to interior rugs. It is important to remove clutter and throw rugs from high-traffic areas and stairs. Make sure that each light fixture has the highest watt bulb possible. Place things in easy reach for your loved one in order to avoid reaching or climbing on chairs. Home modifications can also include encouraging your loved one to wear non-slip footwear in the house and not to walk around in stocking feet!<\/p>\n<h5>3. Look at your loved one’s medications:<\/h5>\n<p>Medications, especially antidepressants and anti-anxiety medications can cause dizziness and fall hazards. Check with your loved one’s physician and ask specifically about the side effects of each medication your loved one takes on a regular basis.<\/p>\n<p>Some medications may help to prevent falls. The CDC reported a study that found that vitamin D and calcium supplements may help to prevent falls. The study found that over women who took vitamin D and calcium supplements over a three year period were 46% less likely to fall compared to women who did not take the supplements. Before giving your loved one supplements check with your loved one’s physician. Supplements can interfere with the efficacy of prescription medications.<\/p>\n<h5>4. Beware of bifocals.<\/h5>\n<p>It has long been suspected that bifocals may contribute to the danger of falls for seniors. A recent study confirms that, saying that “…wearers of multifocal glasses have a high risk of falls when outside their homes and when walking up or down stairs.” The study also found that multifocal and bifocal glasses impair depth perception and make it more difficult to navigate steps and raised surfaces. When researchers provided seniors with single lens distance prescriptions to wear outdoors, falls were decreased by 40%. It pays to have two pair of glasses for your loved one; a single lens pair with a distance prescription for walking up or down outdoor stairs, in shopping centers or unfamiliar buildings, and bifocals as needed at home.<\/p>\n<p>Have you found any helpful ways to prevent falls at home for your loved one? If so we would be interested in hearing about them. Every home environment is as different as each senior and sharing helpful tips helps all of us to prevent dangerous falls.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Falls pose one of the greatest dangers to a senior’s independence and self-sufficiency. More than one-third of people aged 65 and older fall each year, and those who fall once are two to three times more likely to fall again. Among older adults, falls are the leading cause of both fatal and nonfatal injuries and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":122,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[15,17,16],"_links":{"self":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts\/121"}],"collection":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/comments?post=121"}],"version-history":[{"count":0,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts\/121\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/media\/122"}],"wp:attachment":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/media?parent=121"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/categories?post=121"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/tags?post=121"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}