{"id":132,"date":"2017-03-15T02:20:20","date_gmt":"2017-03-15T02:20:20","guid":{"rendered":"http:\/\/enhanced-carers.local\/\/?p=132"},"modified":"2017-03-15T02:20:20","modified_gmt":"2017-03-15T02:20:20","slug":"can-grapes-help-protect-against-alzheimers-decline","status":"publish","type":"post","link":"https:\/\/enhancedcarers.com\/can-grapes-help-protect-against-alzheimers-decline\/","title":{"rendered":"Can grapes help protect against alzheimer’s decline?"},"content":{"rendered":"<p>A pilot study at the University of California, Los Angeles looked at whether consuming grapes could help fight the effects of Alzheimer’s disease. In a double-blind, placebo-controlled study, researchers, led by Dr. Daniel H. Silverman, worked with people with early memory decline. They broke the volunteers into two groups – one that received whole grape powder and another that received a placebo powder that looked and tasted like the grape powder. The “grape group” received the equivalent of 2 ¼ cups of grapes per day. The researchers measured participants’ cognitive performance at the beginning of the study and again six months later. Brain metabolism was also measured at the beginning of the study and six months later by PET scans of the brain. These scans provide both predictive and diagnostic value to health professionals who are evaluating patients presenting with signs of dementia.<\/p>\n<p>When people have Alzheimer’s disease, their brains aren’t working as they should. Some of that, experts believe, is due to problems with brain metabolism. The brain, like the rest of the body, needs energy to work properly. The areas of the brain most affected by Alzheimer’s disease tend to need the most energy. The process of converting food to energy for the brain is, in very basic terms, brain metabolism. Healthy brain metabolism is essential for proper functioning. The study results showed that people with early memory decline had healthy metabolic activity in the regions of the brain most affected by early Alzheimer’s when they consumed the grape powder, but the people who consumed the placebo powder actually had a significant decline in metabolic activity in the same regions of the brain.<\/p>\n<p>The study also showed that the “grape group” had positive changes in brain metabolism that correlates with cognitive improvement and improved performance of the working memory.<\/p>\n<p>The results of the pilot study were published in the journal Experimental Gerontology[HT1]. What the results showed is that eating grapes every day preserved healthy metabolism, prevented decline of brain metabolism, and improved both memory and attention. According to Dr. Silverman, the study results “suggest that regular intake of grapes may provide a protective effect against early decline associated with Alzheimer’s disease.”<\/p>\n<p>Why does eating grapes seem to work? There is evidence that the polyphenols in grapes help promote anti-inflammatory and antioxidant activity in the brain. There is also research that suggests grapes may help encourage a healthy brain by reducing oxidative stress in the brain (which can lead to brain function decline), helping maintain levels of a chemical in the brain that promotes memory, and having anti-inflammatory effects.<\/p>\n<p>While the study results are exciting, Dr. Silverman says further studies need to be done with larger groups.<\/p>\n<p>At Home Care Assistance, we promote healthy brains and improved quality of life for our clients through multiple programs, including the Balanced Care Method – a holistic approach to healthy longevity – and the Cognitive Therapeutics Method – a cognitive stimulation program developed to keep aging minds sharp.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A pilot study at the University of California, Los Angeles looked at whether consuming grapes could help fight the effects of Alzheimer’s disease. In a double-blind, placebo-controlled study, researchers, led by Dr. Daniel H. Silverman, worked with people with early memory decline. They broke the volunteers into two groups – one that received whole grape [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":133,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[20,9,21],"_links":{"self":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts\/132"}],"collection":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/comments?post=132"}],"version-history":[{"count":0,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts\/132\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/media\/133"}],"wp:attachment":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/media?parent=132"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/categories?post=132"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/tags?post=132"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}