{"id":147,"date":"2017-03-16T08:54:05","date_gmt":"2017-03-16T08:54:05","guid":{"rendered":"http:\/\/enhanced-carers.local\/\/?p=147"},"modified":"2017-03-16T09:07:29","modified_gmt":"2017-03-16T09:07:29","slug":"how-to-build-a-long-distance-care-team","status":"publish","type":"post","link":"https:\/\/enhancedcarers.com\/how-to-build-a-long-distance-care-team\/","title":{"rendered":"How to build a long distance care team"},"content":{"rendered":"<p>We live in a mobile society and that means that adult children are not always going to live in close proximity to aging parents. That makes it difficult to make sure their daily needs are addressed, especially if illness or chronic disease strikes. It is possible to put together a long distance care team that will provide for your loved one and give you some peace of mind. Here are some tips on how to put together a reliable team that will serve the best interests of the senior you love.<\/p>\n<h5>1. Ask the senior how you can be most helpful<\/h5>\n<ul>\n<li>What do they need daily?<\/li>\n<li>What tasks are difficult for them?<\/li>\n<li>Do they have regular weekly or monthly appointments – hair, physician etc. that they need transportation to and from?<\/li>\n<\/ul>\n<h5>2. Talk to the senior’s physician<\/h5>\n<ul>\n<li>If the senior is willing to give you written permission, or you are the health care proxy, ask the physician to update you about the senior’s health. You can also discuss this with your loved one, but often seniors will hide information about their health condition for fear of losing their independence. You need to know exactly what the health impairments are in order to address them appropriately.<\/li>\n<li>If you do not have permission or are not the health care proxy the physician cannot, by law, release private medical information to you. However, he or she may be willing to suggest the types of support that think will be most helpful.<\/li>\n<\/ul>\n<h5>3. Talk to friends, family members, neighbors of your loved one<\/h5>\n<ul>\n<li>Can a schedule of support and help be created?<\/li>\n<li>Can a neighbor’s child take out the garbage or walk your loved one’s dog?<\/li>\n<li>Can a sibling who lives close by take your loved one grocery shopping?<\/li>\n<li>Can neighbors or family members check in the senior regularly, especially during extreme hot and cold weather?<\/li>\n<li>Make sure everyone has all your phone numbers, your e-mail and other contact information.<\/li>\n<\/ul>\n<h5>4. Rely on local resources<\/h5>\n<p>There are many organizations that provide support for seniors. You can find the ones in your loved one’s area by checking these sources of information:<\/p>\n<ul>\n<li>Eldercare Locator, 1-800-677-1116 (toll-free)<\/li>\n<li>National Institute on Aging website<\/li>\n<li>Family Care Navigator<\/li>\n<li>Your state government’s website, search for “elder care”, “senior care”, or “INSERT STATE NAME Executive Office of Elder Affairs.”<\/li>\n<\/ul>\n<p>Home Care agencies can also be a great resource to rely on. Certified, professional home caregivers can take care of your loved one and keep you updated on their condition.<\/p>\n<h5>5. Keep detailed records<\/h5>\n<ul>\n<li>Create a 3-ring binder in which you can keep notes, medical records, insurance information, calendars and even printed copies of emails. This will be a great help to you as the care of your loved one becomes more complex<\/li>\n<li>Include contact information for all physicians, nurse practitioners, physician assistants, case managers and specialists, like physical therapists<\/li>\n<li>Make copies for all those involved in the support and care of your loved one and keep the records updated<\/li>\n<\/ul>\n<p>The National Institute for Aging is a great resource for information on long-distance caregiving. They have two downloadable publications:<\/p>\n<ul>\n<li>Long-Distance Caregiving: Twenty Questions and Answers<\/li>\n<li>Long-Distance Caregiving—A Family Affair<\/li>\n<\/ul>\n<p>The NIH also has a webpage dedicated to caregiving. It is a rich source of information that lists numerous books, fact sheets and information pages on a wide range of issues involved in caregiving. Last week, we published a piece on how to manage the Emotional impact of Long-Distance Care – an aspect of caring for your loved one that you don’t want to miss.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We live in a mobile society and that means that adult children are not always going to live in close proximity to aging parents. That makes it difficult to make sure their daily needs are addressed, especially if illness or chronic disease strikes. It is possible to put together a long distance care team that [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":149,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8,19],"tags":[24,11,22,23],"_links":{"self":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts\/147"}],"collection":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/comments?post=147"}],"version-history":[{"count":0,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/posts\/147\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/media\/149"}],"wp:attachment":[{"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/media?parent=147"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/categories?post=147"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/enhancedcarers.com\/wp-json\/wp\/v2\/tags?post=147"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}